# 타이타닉 logistic regression

In [1]:
import pandas as pd

passengers = pd.read_csv("titanic_train_set.csv")
passengers

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [2]:
passengers.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [3]:
feature = passengers[['Sex', 'Age', 'Pclass']]
y = passengers['Survived']

In [4]:
feature.isna().sum()

Sex         0
Age       177
Pclass      0
dtype: int64

In [5]:
#feature['Age'] = feature['Age'].fillna(value=feature['Age'].mean())
feature['Age'].fillna(value=feature['Age'].mean(), inplace=True)

/Applications/anaconda3/lib/python3.8/site-packages/pandas/core/series.py:4463: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().fillna(

In [6]:
feature.isna().sum()

Sex       0
Age       0
Pclass    0
dtype: int64

In [7]:
feature['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [8]:
feature['FirstClass'] = feature['Pclass'].apply(lambda x:1 if x==1 else 0)
feature['SecondClass'] = feature['Pclass'].apply(lambda x:1 if x==2 else 0)

<ipython-input-8-5d6018a31b73>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  feature['FirstClass'] = feature['Pclass'].apply(lambda x:1 if x==1 else 0)
<ipython-input-8-5d6018a31b73>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  feature['SecondClass'] = feature['Pclass'].apply(lambda x:1 if x==2 else 0)

In [9]:
feature = feature[['Sex', 'Age', 'FirstClass', 'SecondClass']]
feature

        Sex        Age  FirstClass  SecondClass
0      male  22.000000           0            0
1    female  38.000000           1            0
2    female  26.000000           0            0
3    female  35.000000           1            0
4      male  35.000000           0            0
..      ...        ...         ...          ...
886    male  27.000000           0            1
887  female  19.000000           1            0
888  female  29.699118           0            0
889    male  26.000000           1            0
890    male  32.000000           0            0

[891 rows x 4 columns]

In [10]:
feature['Sex'] = feature['Sex'].map({'female':0, 'male':1})
feature

     Sex        Age  FirstClass  SecondClass
0      1  22.000000           0            0
1      0  38.000000           1            0
2      0  26.000000           0            0
3      0  35.000000           1            0
4      1  35.000000           0            0
..   ...        ...         ...          ...
886    1  27.000000           0            1
887    0  19.000000           1            0
888    0  29.699118           0            0
889    1  26.000000           1            0
890    1  32.000000           0            0

[891 rows x 4 columns]

In [11]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()

In [12]:
X = feature

In [13]:
#X = scaler.fit_transform(X)

In [14]:
from sklearn.model_selection import train_test_split

In [15]:
X_train, X_test, y_train, y_test = train_test_split(X, y, random_state=0)

X_train = scaler.fit_transform(X_train)
X_test = scaler.transform(X_test)

In [16]:
from sklearn.linear_model import LogisticRegression

model = LogisticRegression(random_state=0)
model.fit(X_train, y_train)

LogisticRegression(random_state=0)

In [17]:
model.score(X_test, y_test)

0.7892376681614349